
def lang_list(lang, sentence):
    languages = {
        'ru': {
            'report_btn': 'Cообщить о правонарушении',
            'instruction_btn': 'Инструкция',
            'for_voters': 'Телеграм-бот QVOTE.ORG ',
            'target_btn': 'Телеграм-бот QVOTE.ORG',
            'switch_btn': 'Сменить язык',
            # 'no_inet_btn': 'Нет интернета в день выборов',
            'inform_about_choice_btn': 'Проголосовать',
            'violation_btn': 'Сообщить об инциденте',
            # 'sos_btn': 'Экстренная помощь (SOS)',
            # 'verification_of_voters_btn': 'Верификация избирателя',
            # 'verification_btn': 'Верификация',
            'target': '🔺 Цель чат-бота «Qvote» - собрать от избирателя следующие данные:\n'
                      '▪️ сообщить о сделанном выборе в результате голосования;\n'
                      '▪️ сообщить о правонарушении -нарушении права\n'
                      'избирателя/выборного процесса на конкретном участке',
            'back_btn': 'Назад',
            'no_inet': '🔺 Что делать, если отключат интернет в день выборов:\n'
                       ' ▪️ Сделать четкую фотографию бюллетеня с двух сторон,\n'
                       ' сохранить на телефон и выслать в чат-бот при первой возможности.\n'
                       ' ▪️ Сохранить на телефоне фото/видео о правонарушении/нарушении'
                       ' избирательного процесса или прав избирателя.\n'
                       ' ▪️ При первой возможности подключения к Интернету вышлите нам эту информацию в чат-бот.'
                       ' Важно помнить, что в случае отсутствия Интернета,'
                       ' высланные вами сообщения  будут получены при первом подключении к сети.',
            'inform_about_choice': '🔺  Как сообщить о сделанном выборе в результате голосования:\n\n'
                                   ' Шаг 1. Необходимо указать последовательно свой регион, город,'
                                   ' район и выбрать свой участок из списка.\n\n'
                                   ' Шаг 2. Выборы в Парламент Казахстана пройдут 10 января 2021 года.\n\n'
                                   '✔️Срочно проверьте есть ли вы в списках избирателей'
                                   ' и где находится ваш избирательный участок: https://cutt.ly/YhKrTPf \n\n'
                                   ' ✔️Проверьте заранее адрес, маршрут и время работы избирательного участка.\n\n'
                                   ' ✔️Прийдите на свой избирательный участок 10 января 2021.'
                                   ' Избирательные участки откроются с 07.00'
                                   ' (некоторые участки с 06.00) и закроются в 20.00.\n\n'
                                   ' ✔️В этот период Вы должны проголосовать в своем участке'
                                   ' и сфотографировать на сотовый телефон бюллетень'
                                   ' голосования внутри кабинки голосования.\n\n'
                                   ' Шаг 3. После того как Вы покинули избирательную кабину,'
                                   ' нажмите на пункт СООБЩИТЬ МОЙ ВЫБОР.\n\n'
                                   ' Шаг 4. Выберите пункт ДОБАВЛЕНИЕ ФОТО БЮЛЛЕТЕНЯ.\n\n'
                                   ' Шаг 5. Выберите из своего телефона четкое/полное фото'
                                   ' бюллетеня с двух сторон и нажмите кнопку отправки.\n\n'
                                   ' Шаг 6. Удостоверится, что в чат-боте вышло сообщение "Спасибо! Ваш голос учтен.',
            'sos': '🔺 Как запросить экстренную помощь (sos):\n\n'
                   ' Шаг 1. Необходимо указать последовательно свой регион,'
                   ' район и выбрать свой участок из списка.\n\n '
                   'Шаг 2. Сообщить свои ФИО\n\n'
                   'Шаг 3. 10 января 2021 при возникновении любых вопросов '
                   'или непонятных ситуации необходимо нажать кнопку SOS.'
                   'Мы ответим вам по мере возможности.\n\n'
                   'Шаг 4. Описать, что именно произошло.'
                   'Выслать голосовое сообщение до 1 мин,'
                   ' а также выслать видео/фото с правонарушением.'
                   ' Сообщить, ФИО лиц, их должности, кто нарушил ваши права.\n\n'
                   'Шаг 4. Дождаться ответа наших волонтеров.'
                   ' Сообщаем, что экстренная помощь в чат-боте заключается в консультации,'
                   ' фиксации для международного сообщества и '
                   'публичной огласки нарушения прав избирательного процесса или прав избирателя.',
            'verification_of_voters': '🔺 Верификация избирателя:\n\n'
                                      'В чат-боте есть необязательная (!) функция верификации'
                                      ' избирателя по номеру телефона. Весь функционал чат-бота доступен,'
                                      ' как и верифицированным, так и не верифицированным избирателям.\n\n'
                                      'После окончания голосования мы посчитаем общую статистику'
                                      ' и отдельную статистику по верифицированным избирателям.',
            'menu': 'Выберите пункт меню',
            'violation': '🔺 Как сообщить о нарушении избирательного процесса на участке?\n\n'
                         'Шаг 1. Необходимо указать последовательно свой регион,'
                         ' город, район и выбрать свой участок из списка.\n\n'
                         'Шаг 2. Выборы в Парламент Казахстана пройдут 10 января 2021 года.'
                         ' Избирательные участки откроются с 07.00 (некоторые участки с 06.00) и закроются в 20.00.'
                         ' Сфотографируйте на сотовый телефон факт правонарушения на избирательном участке.\n\n'
                         'Помните, что Статья 20-1. Закона о выборах в Казахстане гарантирует право\n'
                         'наблюдателей политических партий, иных общественных объединений, '
                         'некоммерческих организаций Республики Казахстан:\n\n'
                         '1) присутствовать на заседании избирательной комиссии;\n\n'
                         '2) получать информацию о количестве избирателей, принявших участие в голосовании,'
                         ' в том числе в голосовании вне помещения;\n\n'
                         '3) находиться в помещении для голосования соответствующего избирательного участка'
                         ' во время проведения голосования и подсчета голосов;\n\n'
                         '4) сопровождать переносные избирательные урны, в том числе находиться'
                         ' в транспортном средстве во время их перевозки;\n\n'
                         '5) наблюдать за ходом голосования, процедурой подсчета голосов и оформления результатов'
                         ' голосования на избирательном участке, в пункте для голосования в условиях,'
                         ' обеспечивающих возможность четкого обозрения всех перечисленных процедур;\n\n'
                         '6) обжаловать решения, действия (бездействие) соответствующей избирательной комиссии'
                         ' и (или) ее членов в вышестоящую избирательную комиссию или суд;\n\n'
                         '7) присутствовать при проведении голосования избирателей вне помещения'
                         ' для голосования в случае невозможности их прибытия в помещение для голосования;\n\n'
                         '8) присутствовать при подсчете и погашении членами участковой избирательной комиссии'
                         ' неиспользованных избирательных бюллетеней;\n\n'
                         '9) делать фото-, аудио - и видеозаписи, не мешая ходу'
                         ' голосования и подведению его итогов;\n\n'
                         '10) наблюдать процедуру передачи протоколов о результатах'
                         ' голосования вышестоящим избирательным комиссиям;\n\n'
                         '11) после проведения голосования знакомиться с протоколами избирательной комиссии'
                         ' об итогах голосования, получать их заверенные копии;\n\n'
                         '12) обращать внимание членов избирательной комиссии на нарушения требований настоящего'
                         ' Конституционного закона, вручать им соответствующие письменные заявления, акты о нарушениях'
                         ' и получать отметки о вручении. Председатель избирательной комиссии, лицо, его замещающее,'
                         ' обязаны по заявлению доверенных лиц, наблюдателей приложить к'
                         ' протоколу подсчета голосов составленные ими акты.\n\n'
                         'Шаг 3. Нажмите на пункт СООБЩИТЬ О ПРАВОНАРУШЕНИИ.\n\n'
                         'Шаг 4. Выберите пункт ЗАГРУЗИТЬ ФОТО/ВИДЕО.\n\n'
                         'Шаг 5. Выберите из своего телефона фото/видео, доказывающие'
                         ' факт нарушения и нажмите кнопку отправки.\n\n'
                         'Шаг 6. Добавьте описание, о том, что произошло. Примечание - в день выборов писать, '
                         'где произошло правонарушение нет необходимости.'
                         ' Вы уже  в шаге 1 указали избирательный участок.',
            # 'violation_date': 'Укажите дату события',
            'violation_city': 'Укажите населенный пункт',
            # 'violation_name_victim': 'Укажите ФИО пострадавшего',
            'violation_about': 'Опишите, что именно произошло',
            # 'violation_name_offender': 'Известно ли ФИО нарушителя прав, укажите',
            # 'violation_position': 'Известна ли должность нарушителя прав, укажите',
            'violation_photo': 'Отправьте фото, видео или аудио-подтверждение правонарушения',
            'violation_completed': 'Спасибо за бдительность',
            'skip': 'Пропустить',
            'vote_btn': 'Проголосовать',
            'voted_photo': 'Отправьте фото бюллетеня с двух сторон\n'
                           '(по одному фото)',
            'area_btn': 'Выберите участок',
            'area': 'Укажите населенный пункт',
            'start': 'Телеграм-бот QVOTE.ORG обеспечивает безопасный сбор результатов'
                     ' голосований и данных об инцидентах или правонарушениях на участках 10 января.',
            'registration': 'Регистрация',
            'station': 'Введите номер избирательного участка:',
            # 'ty_for_choose': 'Спасибо что выбрали участок',
            'ty_for_vote': 'Ваш голос — очень важен',


        },
        'kz': {
            'report_btn': 'Құқық бұзушылық туралы хабарлау',
            'instruction_btn': 'Нұсқаулық',
            'for_voters': '«Qvote» ДАУЫС БЕРУШІЛЕР ЧАТ-БОТЫ',
            'target_btn': '«Qvote» чат-боттың мақсаты',
            'switch_btn': 'Тілді ауыстыру',

            # 'no_inet_btn': 'Сайлау күні интернет өшірілсе',
            'inform_about_choice_btn': 'Дауысты тіркеу',
            'violation_btn': 'Оқиға туралы хабарлау',
            # 'sos_btn': 'Шұғыл көмек (SOS)',
            # 'verification_of_voters_btn': 'Сайлаушыларды верификациялау',
            # 'verification_btn': 'Верификация',
            'target': '🔺 «Qvote» чат-боттың мақсаты — сайлаушыдан келесі мәліметтерді жинау:\n'
                      '  ▪️ сайлау кезінде жасаған таңдауы туралы хабарлау;\n'
                      '  ▪️ құқық бұзушылық — нақты сайлау учаскедегі сайлаушы\n'
                      '  құқығының/сайлау процесінің бұзылуы туралы хабарлау.',
            'back_btn': 'Артқа',
            'no_inet': '🔺 Cайлау күні интернетті өшіргенде не істеу керек:\n'
                       '  ▪️ Бюллетенді екі жағынан суретке анық түсіріп, телефонға сақтайсыз да,'
                       ' алғашқы мүмкіндік туған жағдайда чат-ботқа жібересіз.\n'
                       '  ▪️ құқық бұзушылық - сайлау процесінің немесе сайлаушының '
                       'құқықтарының бұзылуын көрсететін фотосуретті/видеожазбаны телефонға сақтаңыз.\n'
                       '  ▪️ Интернетке қосылған жағдайда бұл ақпаратты бірден біздің чат-ботқа жіберіңіз.'
                       ' Ескеретін нәрсе, Интернет жоқ болған жағдайда, сіз жіберген'
                       ' хабарламалар тек желіге қосылғанда ғана жеткізіледі.',
            'inform_about_choice': 'sss',
            'sos': '🔺 Шұғыл көмекті (SOS) қалай сұрауға болады?\n\n'
                   'Қадам N1. Өз аймағыңызды, ауданыңызды дәйекті түрде көрсетіп,'
                   ' тізімнен өз учаскеңізді таңдауыңыз қажет.\n\n'
                   'Қадам N2. Толық аты-жөніңізді көрсетіңіз\n\n'
                   'Қадам N3. 2021 жылы 10 қаңтарда сізде сұрақтар немесе түсініксіз жағдайлар туындаса,'
                   ' SOS батырмасын басу керек.  Біз сізге мүмкіндігімізше жауап береміз.\n\n'
                   'Қадам N4. Нақты не болғанын сипаттаңыз.  1 минутқа дейін дауыстық хабарлама жіберіңіз.'
                   ' Сондай-ақ ереже бұзылғаны туралы бейнені / фотосуретті жіберіңіз. '
                   ' Сіздің құқығыңызды бұзған адамдардың аты-жөнін, олардың лауазымдарын хабарлаңыз.\n\n'
                   'Қадам N5. Біздің еріктілерден жауап күтіңіз.  Чат-боттағы жедел көмек кеңес беруден,'
                   ' халықаралық қоғамдастық үшін белгілеуден және сайлау процесінің немесе '
                   'сайлаушының құқықтарының бұзылуын көпшілік алдында жария етуден тұратынын хабарлаймыз.',
            'verification_of_voters': '🔺 Сайлаушыларды верификациялау.\n\n'
                                      'Чат-ботта сайлаушыларды телефон нөмірі бойынша тексерудің'
                                      ' міндетті емес (!) қосымша верификация функциясы бар.'
                                      '  Чат-боттың барлық функциялары верификацияланған және'
                                      ' верификацияланбаған сайлаушылар үшін қол жетімді. '
                                      'Дауыс беру аяқталғаннан кейін біз жалпы статистиканы бір бөлек және'
                                      ' верификацияланған сайлаушылар бойынша статистиканы бір бөлек есептейміз.',
            'menu': 'Выберите пункт меню',
            'violation': '🔺 Сайлау учаскесіндегі сайлау процессі кезіндегі '
                         'құқық бұзушылық туралы қалай хабарлауға болады?\n\n'
                         'Қадам N1. Өз аймағыңызды, қалаңызды, ауданыңызды дәйекті түрде көрсетіп,'
                         ' тізімнен өз учаскеңізді таңдауыңыз қажет.\n\n'
                         'Қадам N2. Қазақстандағы Парламент сайлауы 2021 жылы 10 қаңтарда өтеді.'
                         '  Сайлау учаскелері сағат 07.00-ден (кейбір сайлау учаскелері 06.00-ден бастап) ашылып,'
                         ' 20.00-де жабылады.  Сайлау учаскесіндегі құқық бұзушылықты суретке'
                         ' түсіру үшін ұялы телефонды пайдаланыңыз.\n\n'
                         'Есіңізде болсын, 20-1 баптың Қазақстандағы сайлау туралы Заңы '
                         'Қазақстан Республикасының саяси партияларының, өзге де қоғамдық бірлестіктердің,'
                         ' коммерциялық емес ұйымдардың бақылаушыларының төмендегі құқықтарына кепілдік береді:\n\n'
                         ' 1) Сайлау комиссиясының отырысына қатысуға;\n'
                         '2) Дауыс берушілердің, сондай-ақ тыс жерден дауыс бергендердің саны туралы ақпарат алуға;\n'
                         '3) Дауыс беру және дауыстарды санау кезінде '
                         'тиісті сайлау учаскесінің дауыс беру бөлмесінде болуға;\n'
                         '4) Тасымалданатын сайлау жәшігімен ілесуге, тасымалдау кезінде көлік құралында болуға;\n'
                         ' 5) Дауыс беру барысын, дауыстарды санау және дауыс беру нәтижелерін нақты қадағалау'
                         ' мүмкіндігін қамтамасыз ететін сайлау учаскесінде бақылауға;\n'
                         ' 6) Тиісті сайлау комиссиясының және (немесе) оның мүшелерінің шешімдеріне,'
                         ' әрекеттеріне (әрекетсіздігіне) жоғары тұрған сайлау'
                         ' комиссиясына немесе сотқа шағым жасауға;\n'
                         ' 7) Сайлаушыларға сайлау учаскесіне келу мүмкін болмаса,'
                         ' дауыс беру учаскесінен тыс жерде дауыс беруге қатысуға;\n'
                         ' 8) Учаскелік сайлау комиссиясының мүшелері санау және'
                         ' пайдаланылмаған бюллетеньдерді жою кезінде қатысуға;\n'
                         ' 9) Дауыс беру барысына және оның нәтижелеріне кедергі келтірмей фото, '
                         'аудио және бейне жазбалар жасауға;\n'
                         ' 10) Дауыс беру нәтижелері туралы хаттамаларды жоғары тұрған'
                         ' сайлау комиссияларына беру тәртібін сақтауға;\n'
                         ' 11) Сайлау өткізілген соң сайлау комиссиясының дауыс беру нәтижелері туралы'
                         ' хаттамаларымен танысуға, олардың куәландырылған көшірмелерін алуға;\n'
                         ' 12) Сайлау комиссиясы мүшелерінің Конституциялық Заң талаптарының бұзылуына'
                         ' назарын аудартуға, оларға тиісті жазбаша өтініштерді, құқықбұзушылық актілерін '
                         'тапсыруға және жеткізілім белгілерін алуға құқылы. '
                         ' Сайлау комиссиясының төрағасы, оның орынбасары сенім білдірілген тұлғалардың,'
                         ' бақылаушылардың өтініші бойынша өздері жасаған актілерді дауыстарды'
                         ' санау хаттамасына қосып беруге міндетті.\n\n'
                         'Қадам N3. ҚҰҚЫҚБҰЗУШЫЛЫҚ ТУРАЛЫ ХАБАРЛАУ пунктін басыңыз.\n\n'
                         'Қадам N4. ФОТО / ВИДЕО ЖҮКТЕУ тармағын таңдаңыз.\n\n'
                         'Қадам N5. Телефоннан құқықбұзушылық фактісін дәлелдейтін фотосуретті'
                         ' / бейнені таңдап, жіберу дегенді басыңыз.\n\n'
                         'Қадам N6. Болған жайттың сипаттамасын қосыңыз.  Ескерту - құқық бұзушылық '
                         'болған жерді жазудың қажеті жоқ.  Сіз сайлау учаскесін бірінші қадамда көрсеттіңіз.',
            # 'violation_date': 'Оқиға күнін көрсетіңіз',
            'violation_city': 'Елді мекенді атаңыз',
            # 'violation_name_victim': 'Жәбірленушінің атын енгізіңіз',
            'violation_about': 'Нақты не болғанын айтып беріңіз',
            'violation_name_offender': 'Құқық бұзушының аты белгілі ме, көрсетіңіз',
            'violation_position': 'Құқық бұзушының позициясы белгілі ме, көрсетіңіз',
            'violation_photo': 'Құқықбұзушылықтың дәлелі болатын фото, видео немесе аудио жолдаңыз',
            'violation_completed': 'Бей-жай қарамағаныңыз үшін рақмет',
            'skip': 'Өткізіп жіберіңіз',
            'vote_btn': 'Дауыс беру',
            'voted_photo': 'Бюллетенді екі бетін түсіріп, жолдаңыз\n'
                           '(бір суреттен)',
            'area_btn': 'Учаскені таңдау',
            'area': 'Аймақты таңдаңыз:',
            'start': 'QVOTE.ORG Телеграм-боты дауыс беру нәтижесін қауіпсіз жинауды қамтамасыз етеді,'
                     ' 10 қаңтарда учаскелердегі оқиғалар мен құқықбұзушылықтар туралы мәлімет береді.\n'
                     'Тілді өзгерту үшін «Сменить язык» батырмасын басыңыз',
            'registration': 'Тіркеу',
            'station': 'Сайлау учаскесінің нөмірін енгізіңіз',
            'ty_for_choose': 'Сайтты таңдағаныңызға рахмет',
            'ty_for_vote': 'Сіздің дауыс — өте маңызды',

        }
    }
    return languages[lang][sentence]



